{
    "bands": [
        {
            "src": "enter_shikari",
            "band": "Enter Shikari",
            "genre": "post-hardcore, trancecore, nintendocore, hardcore, electronic, screamo",
            "photo": "enter_shikari.jpg",
            "descr": "Enter Shikari is a four-piece experimental post-hardcore band from St Albans, Hertfordshire, England formed in 2003.\nThe band's music incorporates various rock and metal sub-genres with elements of various electronic genres such as electronica, dubstep, trance, and drum and bass, making the band particularly difficult to assign to one genre.\nThe incorporation of electronic genres has become more prominent in their music throughout the band's history. Lyrically, their music tackles political, social and scientific issues.\n\nThe band is named after a boat belonging to Roughton \"Rou\" Reynolds' uncle, and a character in a play which he wrote before forming the band, both of which are named Shikari.\nDespite being offered several major label record deals, their debut album Take to the Skies was released on their own label - Ambush Reality - in March 2007,\nreaching the dizzy heights of #4 in the UK's official Album Charts and going on to sell over 100,000 copies in the UK (the album was released in Europe through PIAS, in North America on Ambush Reality / Tiny Evil, and in Japan on Hostess).\n\nIn March 2008, after spending 12 months on the road across the globe, Enter Shikari set up camp in their rehearsal room (a large shed in Chris Batten's back garden which they christened \"The 'Low\") to begin writing tracks for\ntheir second album such as Antwerpen which was released as a free digital-download from the band's website.\n\nIn July they played to their largest live audience at the UK date of Linkin Park's 'Project Revolution' travelling festival alongside JayZ, Pendulum and N*E*R*D, as well as playing several shows with Linkin Park in mainland Europe.\n\nEnter Shikari followed a UK / Ireland tour in October 2008 with the release of a one-off single 'We Can Breathe In Space, They Just Don't Want Us To Escape'\n(a finished version of a track the band demoed in 2005 but never got around to ever finishing properly until the summer 2008).\n\nIn mid-November 2008 the band started work recording their second album in Arreton Manor on the Isle of Wight with producer Andy Gray. Here they demoed,\nproduced and mixed new tracks for the band's second album titled Common Dreads which was released June 15th 2009 on CD, Vinyl and digital download.\nThe first track to be heard by the public was Juggernauts aired on 15th April 2009 as Zane Lowe's \"Hottest Track in the World\" on BBC Radio 1.\nJuggernauts was released on the 1st June 2009 reaching #26 in the UK Official Single Charts and was aired regularly by Radio 1.\n\nFollowing the release of Common Dreads via Ambush Reality on the 15th June 2009, the album reached #16 on the UK Top 40 Official Album Chart and was highly-rated by magazines such as Kerrang!, Rocksound and Metal Hammer.\nNo Sleep Tonight was also released as a single on August 17th 2009 with a large number of remixes following it from artists such as ROUT, Mistabishi, The Qemists and LightsGoBlue.\n\nThe band recently visited the US, Germany and the Czech Republic on a mini-tour and have another UK tour scheduled for October 2009 supported by The Devil Wears Prada and also a number of dates with The Prodigy in November.\n\nAfter their late 2009 UK tour, Enter Shikari toured throughout the US on the extensive summer of 2010 Vans Warped Tour. November 2010 saw Enter Shikari touring with 30 Seconds to Mars.\n\nEnter Shikari's third album titled A Flash Flood Of Colour was recorded at Karma Bay Studios in Bangkok, Thailand and was produced by Dan Weller (former-SikTh guitarist). The album was released on the 16th January 2012 in the UK and worldwide.\nThe first single from the LP was \"Sssnakepit\". It was released on September 20, 2011 as a digital download. According to the Sssnakepit Songfacts, \"Quelle Surprise,\" which was made available in May 2011,\nwas originally intended to be the first official release from the set, but the band ultimately decided to not include it on the album in the end, although did include it on the Deluxe Version. The second single,\n\"Ghandi Mate, Ghandi\" was released as a digital download on iTunes in December, followed by a video of single 'Arguing with Thermometers' posted on YouTube a few days before the release of the album.\nEnter Shikari is:\nRoughton 'Rou' Reynolds - vocals, electronics \nLiam 'Rory' Clewlow - guitar, vocals \nChris Batten - bass, vocals \nRob Rolfe - drums"
        },
        {
            "src": "alexisonfire",
            "band": "Alexisonfire",
            "genre": "post-hardcore, screamo, hardcore, emocore, canadian artist, emo",
            "photo": "alexisonfire.jpg",
            "descr": "Alexisonfire (pronounced 'alexis-on-fire') is a band from St. Catharines, Ontario, Canada. Their music is characterized by turbulent and explosive dynamics with intricate guitar melodies.\nConsisting of five friends, they formed in late 2001 as the result of a three-band break up.\n\nThe band’s name is inspired by a lactating contortionist stripper named Alexis Fire. This caused problems when she discovered that they were using her website name (alexisonfire.com) as their band name, and threatened to sue.\nHowever, since she had never trademarked the title nothing became of these threats. In the end, the band decided to change their website’s URL in spite to theonlybandever.com\n\nAlexisonfire’s lyrical topics range from relationship troubles to go-karting. They have two primary vocalists, screaming duties carried out by George Pettit, and singing by Dallas Green, with support from Wade MacNeil.\n\nWhile their largest fanbase is in their home country of Canada, they also became more popular in other parts of the world, including Japan, Australia, Europe and the US.\nIn the second half of 2010, they toured Australia with Break Even, Europe with Chickenhawk and The Computers and then Canada with Norma Jean and La Dispute.\n\nThe band was nominated for \"ugliest rock band ever\" at the CASBY awards (held by local Toronto radio station) but lost out to another Canadian born band, Sum 41. In 2010 they then won the \"Best New Single\" Award for their track The Northern.\nMembers:\n* George Pettit - Vocals (2001-present)\n* Dallas Green - Guitar and vocals (2001–present)\n* Wade MacNeil - Guitar and vocals (2001–present)\n* Jordan 'Ratbeard' Hastings - Drums (2005–present)\n* Chris Steele - Bass (2001–present)\n\nFormer Members:\nJesse Ingelevics - Drums (2001-2005)\nAnnounced on their website on June 14th 2005 that he was leaving the band because he had slowly grown apart from the band, and wanted to spend more time with his family and fiancée.\nHis relationship with Alexisonfire slowly deteriorated, and \"keep it on wax\" documented this.\n\nSide Projects\n* City and Colour - Dallas Green's solo project.\n* Black Lungs - A band formed by Wade MacNeil as lead vocalist, originally featuring George Pettit playing bass and Jordan Hastings on drums and Sean McNabb. After a few shows disolved to being Wade's solo project.\n* Strange Notes - A project of George's where he interviews people from different bands.\n* Cunter - A band where drummer Jordan Hastings plays with some members from Moneen.\n*Dead Tired A band formed by George.\n*Say Yes A band that Hastings drums in.\n*Gallows A band that Wade Macneil is currently the vocalist for.\n\nDiscography\n* \"Math Sheet Demos\" (3 Song Demo) - 2001\n* \"Pink Heart Skull Sampler\" (2 Song Demo) - 2002\n* \"Alexisonfire\" (Debut Album) - 2002\n* \"Brown Heart Skull Sampler\" (2 Song Demo) - 2004\n* \"Watch Out!\" (Album) - 2004\n* \"The Switcheroo Series\" (EP, split with Moneen) - 2005\n* \"Crisis\" (Album) - 2006\n* \"Crisis (Bonus Tracks)\" (Two Songs, download only, but appeared on the Japanese Pressing of the album) - 2006\n* \"Old Crows / Young Cardinals\" (Album) - 2009\n* \"Old Crows / Young Cardinals (Bonus Tracks)\" (Two Songs, download only, but appeared on the Japanese Pressing of the album) - 2009\n* \"iTunes Original\" (EP) - 2010\n* \"Dog's Blood\" (EP) - 2010\n* \"Death Letter\" (EP) - 2012\n* \"Live at Copps\" (Live Album/DVD) - 2016"
        },
        {
            "src": "a_day_to_remember",
            "band": "A Day to Remember",
            "genre": "post-hardcore, hardcore, pop punk, screamo, metalcore, emocore",
            "photo": "a_day_to_remember.jpg",
            "descr": "A Day to Remember is a band from Ocala, Florida, founded in 2003 by guitarist Tom Denney and drummer Bobby Scruggs.\nThey are mainly known for their unusual amalgamation of metalcore and pop punk as a musical style, as well as playing other styles.\nThe band consists of vocalist Jeremy McKinnon, rhythm guitarist and backing vocalist Neil Westfall, bassist Joshua Woodard, percussion and drummer Alex Shelnutt and lead guitarist Kevin Skaff.\n\nSigning with Indianola for their first album, And Their Name Was Treason (2005), Scruggs was replaced by Shelnutt in 2006.\nLater that year the band recorded For Those Who Have Heart (2007) for Victory. They embarked on several tours of the UK and U.S. and played at several festivals, before recording and releasing Homesick (2009).\nWhile promoting Homesick on tour, Denney was replaced by Skaff. Soon after releasing their next album, What Separates Me from You (2010), the band went on a worldwide tour to promote it.\nIn 2011, the band was involved in a lawsuit with Victory over their recording contract, which was settled in October 2013. The band released their fifth album, Common Courtesy (2013), the same month.\n\nCurrent Members:\n\nJeremy McKinnon – lead vocals (2003–present)\nNeil Westfall – rhythm guitar, backing vocals (2003–present)\nJoshua Woodard – bass guitar (2003–2004, 2004–present)\nAlex Shelnutt – drums (2006–present)\nKevin Skaff – lead guitar, backing vocals (2009–present)\n\nFormer members:\n\nTom Denney – lead guitar, backing vocals (2003–2009); session musician (2009–present)\nBrandon Roberts – drums (2004)\nBobby Scruggs – drums (2003–2004, 2004–2006)\nJason – bass guitar (2004)\n\nDiscography\n1. And Their Name Was Treason (2005)\n2. For Those Who Have Heart (2007)\n3. Homesick (2009)\n4. What Separates Me from You (2010)\n5. Common Courtesy (2013)\n6. Bad Vibrations (2016)"
        },
        {
            "src": "underoath",
            "band": "Underoath",
            "genre": "post-hardcore, screamo, metalcore, hardcore, christian, emo",
            "photo": "underoath.jpg",
            "descr": "Underoath (occasionally typeset as underOATH or UNDERØATH) is an American metalcore/post-hardcore band originally formed on November 30, 1997 in Ocala,\nFlorida, but later relocated to Tampa, Florida, which was home to some of their newer members. \n\nDuring the band's early years, when they were fronted by former vocalist Dallas Taylor, Underoath displayed a heavier style than their later, more well-known work,\nincorporating disparate influences from death and black metal. With Taylor, they released Act of Depression, Cries of the Past, and The Changing of Times. Following Taylor's departure,\nSpencer Chamberlain became lead vocalist.\nThe band then released They're Only Chasing Safety and Define the Great Line, gaining a certified gold rating and the highest-charting Christian album on The Billboard 200 since 1997, respectively.\nThese two albums have given them more mainstream and commercial success. They're Only Chasing Safety marked an extreme departure from their earlier work, with extensive use of clean vocals and poppy rhythms,\nand a near-complete eradication of breakdowns and the use of double-bass. Define The Great Line reflected another shift in style, once again incorporating heavier styles into Underoath's sound.\nWhile the album still featured extensive clean vocals, its use of heavier vocals, detuned guitars, and Botch-inspired guitar work paved the way for Underoath's future.\n\nUnderoath released a live album called Survive, Kaleidoscope on May 27, 2008. Earlier that year, the band recorded a new studio album called Lost in the Sound of Separation,\nwhich was released on September 2, 2008, peaking at number 8 on the Billboard 200. In April 2010, Aaron Gillespie announced his resignation from the band, stating that there are no hard feelings\nand that he will continue to pursue his other band, The Almost, leaving Underoath with none of its founding members.\n\nThe band recorded their seventh album with new drummer Daniel Davison, formerly of Norma Jean. The album, Ø (Disambiguation), was released on November 9, 2010.\n\nIn October 2012, Underoath announced that they would be disbanding the following year, in addition to a career-spanning compilation album, Anthology: 1999–2013, which was released on November 6, 2012.\nThe band then embarked on a nine-date farewell tour, which wrapped up at Jannus Live in St. Petersburg, Florida on January 26, 2013.\n\nIn January 2015, the band launched a campaign to finalize production of documentary film about their farewell tour of 12 shows, posting two trailers on that subject to their YouTube channel.\n\nIn July 2015, Underoath began teasing the phrase \"rebirth is coming\" and an accompanying cryptic video across their social media accounts. The audio portion to the cryptic video, when played backwards,\nturned out to be the chorus for \"It's Dangerous Business Walking Out Your Front Door\" off the band's 2004 album They're Only Chasing Safety, and later a countdown timer ending on August 24, 2015 later appeared on the band's website.\n\nOn August 17, 2015, the band's first show since disbanding in 2013 was announced, headlining the Self Help Fest in San Bernardino, California on March 19, 2016, along with A Day to Remember.\nIn an interview article for Alternative Press, Chamberlain and Gillespie confirmed that the band was reuniting."
        },
        {
            "src": "escape_the_fate",
            "band": "Escape the Fate",
            "genre": "post-hardcore, screamo, emocore, hardcore, emo, metalcore",
            "photo": "escape_the_fate.jpg",
            "descr": "Escape the Fate is a post-hardcore band which formed in 2005 in Las Vegas, Nevada, United States. The band currently consists of Robert Ortiz (drums). Craig Mabbitt (vocals),\nKevin \"Thrasher\" Gruft (guitar, keyboards, vocals), and touring member Erik Jensen (bass). Ortiz is the only original member still in Escape the Fate. The band has released six studio albums: two on Epitaph, one on DGC, and three on Eleven Seven.\n\nBefore forming Escape the Fate, vocalist Ronnie Radke, bassist Max Green, drummer Robert Ortiz, lead guitarist Bryan Monte Money, and rhythm guitarist Omar Espinosa were in multiple bands together.\n\nIn September 2005, Escape the Fate had won a local radio contest judged by My Chemical Romance. The gig awarded them the opportunity to open a show on the band's headlining tour with Alkaline Trio and Reggie and the Full Effect,\nwhich subsequently led to Escape the Fate's record deal with Epitaph.\n\nOn May 23, 2006, the band released their debut EP titled There's No Sympathy for the Dead. The EP included two songs that were later on their full length album, Dying Is Your Latest Fashion.\nThe EP was produced by Michael Baskette and helped earn the band attention from record labels and fans alike. After the EP's release, keyboardist Carson Allen left the band to join On the Last Day.\n\nOn September 26, 2006 the band released their first full-length album, Dying Is Your Latest Fashion.\n\nIn 2007, during the Black on Black tour, rhythm guitarist Omar Espinosa left the band due to personal issues.\n\nRonnie Radke was asked to leave the band after he was sentenced to prison in June 2008 for multiple run-ins with the law involving narcotics and battery for a fight that led up to the death of Michael Cook.\nAs stated by Max Green, \"First we couldn't tour out of the country, then out of the state.\"\n\nAfter the departure of Radke, former Blessthefall vocalist Craig Mabbitt joined the band, first as a temporary replacement, and then as a permanent member.\n\nThis War Is Ours was released on October 21, 2008. It included the singles \"The Flood\", \"Something\", \"10 Miles Wide\", and \"This War Is Ours (The Guillotine II)\".\nIt was the first Escape the Fate album featuring Craig Mabbitt as the vocalist.\n\nEscape the Fate announced via a MySpace bulletin that they would film a video for \"This War Is Ours (The Guillotine II)\" on January 9, 2010. It was filmed at the Yost Theater in Santa Ana, California.\n\nOn February 15, 2010, Epitaph Records announced the re-release of the This War Is Ours album in deluxe CD/DVD edition. The CD includes two new never before heard songs,\nlater identified to be \"Bad Blood\" and \"Behind the Mask\", an acoustic version of \"Harder Than You Know\",\nand an unreleased remix of \"This War Is Ours (The Guillotine II)\" called \"This War Is Mine\", remixed by the Shawn Crahan.\nIt also came with a DVD that featured the new music video to \"This War Is Ours (The Guillotine II)\", as well as \"Something\", \"The Flood\", and \"10 Miles Wide\".\nIt also comes with a world tour documentary and a behind the music feature. It released April 27, 2010.\n\nIn an interview during Warped Tour 2009, Max Green stated that the album will feature a song co-written by Mick Mars of Mötley Crüe, who approached Escape the Fate to collaborate on some songs,\nbut later was revealed that they decided against putting the song on the album and saving for a future release.\n\nStarting July 24, 2010, they set off on tour for South and Central America, the country's toured are Brazil, Argentina, Colombia, Chile, Colombia and Venezuela.\n\nOn July 26, 2010, Escape the Fate announced via MySpace some new updates on the album. They officially said that the new record will be released through major record label, DGC/Interscope,\nand produced by Don Gilmore (Linkin Park, Bullet For My Valentine, Hollywood Undead).\nIts release was set for November 2nd, 2010. Max Green commented on it, saying, \"This record is the cure for the modern day music epidemic,\nWe are wiping the slate clean and re-writing rock music as you know it.\" Escape The Fate were set to take on a United States, Canada,\nand Europe tour prior to release of the album, with Bullet For My Valentine, Drive A and Black Tide, but later forfeited their spot due to Max Green admitting to rehab.\n\nOn August 31, 2010, the band released the album's first single, \"Massacre.\" Their second single, and first official one to be released to radio stations, \"Issues\",\nfrom the self titled album, Escape the Fate, leaked via KROQ Radio on the 9th of September, and later officially released the single,\n\"Issues\", on September 15, 2010. The music video of \"Issues\", premiered September 28 on Youtube. December 21, the next single released was \"City of Sin\" with a music video for it on Youtube.\n\nOn January 11, 2011, the band performed live in \"Tues Show\" (Fuel.tv) the song \"Issues\" and \"Gorgeous Nightmare\" with the special collaboration of Kevin Thrasher (of Lovehatehero).\nOn June 15, 2011, the band release a music video for their next single off the self-titled album,\n\"Gorgeous Nightmare\". The video was directed by Robby Starbuck, who has previously worked with Asking Alexandria and Silverstein. On August 19, 2011,\nthe band announced via Facebook that Monte Money would be taking a break from touring but will still be in the band. Kevin Thrasher,\nwho has worked with the band in the past, will be substituting for Monte. It was also announced that Max Green returned to the band after taking a break through\nthe first half of 2011 to recover from his addiction with drugs through rehab. “I’m feeling great and am glad to be back with my band.\nEscape The Fate is my life. This is where I belong.”, Max Green said. After they played a couple of shows on the 2011 Uproar Festival, Max, again,\nleft the band and Zakk Sandler, from Black Tide (who was also playing Uproar), filled in for him.\n\nTj Bell, currently bassist of Get Scared once again filled in for bassist Max Green on the bands UK tour with Funeral For A Friend,\nwho had previously filled in for Green on their tour with Papa Roach.\n\nIn mid-December 2011, the band re-entered the studio to work on the production of their fourth album.\nThe album will be produced by John Feldmann and is scheduled for release some time in 2012.\nIt is currently unknown if Max Green has returned to the band to play bass on the upcoming album or if the band hired a new bassist.\nHowever, there is much speculation as to former Motionless In White and current Get Scared bassist TJ Bell will be taking over on bass due to the band\ntweeting pictures of him recording in the studio, plus his recent touring history with the band filling in for Max Green.\n\nOn December 27, Craig Mabbitt posted on his official Facebook page that he will be recording music for his new side-project all through January 2012 and\nrecording for Escape the Fate all through February. He commented that since they are recording with John Feldmann again,\nwho they worked with on their second album,This War Is Ours, the style of the upcoming album will be similar to This War Is Ours but will also have\nelements of their self-titled album added in. He teased a big upcoming announcement as well.\n\nCurrent members:\n\nRobert Ortiz - drums, percussion, backing vocals (2004–present)\nCraig Mabbitt - lead vocals (2008–present)\nThomas \"TJ\" Bell - rhythm guitar (2013-present), bass guitar (2012-2013), (touring 2011-2012)\nKevin \"Thrasher\" Gruft - lead guitar (2013–present), (touring 2011)\nErik Jensen – bass guitar, backing vocals (touring 2017–present)\n\nFormer members:\n\nCarson Allen - keyboards, synthesizers, vocals (2005–2006)\nOmar Espinosa - rhythm guitar, backing vocals (2004–2007)\nRonnie Radke - lead vocals (2004–2008)\nBryan \"Monte\" Money - lead guitar, backing vocals (2004-2013)\nMichael Money - rhythm guitar (2012–2013), (touring 2008-2012)\nMax Green - bass guitar, backing vocals (2004-2012, 2013–2014)\n\nFormer touring members:\nZakk Sandler – bass guitar, backing vocals (2011)\nDavey Richmond – bass guitar (2014)\nAlex Torres – bass guitar (2014; 2015)\nTyler Burgess – bass guitar (2015)\nMax Georgiev – bass guitar, backing vocals (2015–2017)\n\nDiscography:\n\n1. Dying Is Your Latest Fashion (September 26, 2006)\n2. This War Is Ours (October 21, 2008)\n3. Escape the Fate (November 2, 2010)\n4. Ungrateful (May 14, 2013)\n5. Hate Me (October 30, 2015)\n6: I Am Human (March 30, 2018)"
        },
        {
            "src": "silverstein",
            "band": "Silverstein",
            "genre": "post-hardcore, screamo, emo, emocore, hardcore, cover",
            "photo": "silverstein.jpg",
            "descr": "Silverstein is a 5-piece post-hardcore band from Burlington, Ontario, Canada; formed in 2000. The band name was taken from the famous children's author Shel Silverstein.\n\nAfter several lineup changes, the band acquired Billy Hamilton, a local fan who learned of the band's need for a bassist on the Internet message board \"The 905 Board\"\n(an Ontario area outreach board which used to be for local musicians). In Christmas of 2001, he joined the band after Shane Told helped him learn the music for the songs.\nFollowing a rehearsal on Boxing Day (December 26) in 2001, he officially debuted with Silverstein. The next spring, original guitarist Richard McWalter left the band to move to Victoria,\nBritish Columbia to study engineering. He was then replaced by Neil Boshart, childhood friend of Shane Told. The new lineup recorded a second EP, When the Shadows Beam, in preparation for their first tour in Eastern Canada.\nThe band then signed to Victory Records in October of 2002 with a complete lineup as Hamilton attempted to complete his secondary education one semester early.\nThe January after, the band recorded their full-length debut CD When Broken Is Easily Fixed, released on the Victory Records label.\n\nIn August 2005 the band's second studio album, Discovering the Waterfront, was released through Victory Records.\nIt was the first album to be produced by Cameron Webb, and marked the beginning of a long relationship between the band and the American producer.\nIt also marked a shift in sound from When Broken Is Easily Fixed, with faster paced and more energetic songs, and with the band also incorporating more punk rock aspects into their music.\nTold's clean and unclean vocals had matured since their previous effort. Discovering The Waterfront opened the band up to a wider audience, with the music video for the first single\n\"Smile in Your Sleep\" receiving airplay on stations such as FUSE and IMF. The album sold 26,229 copies in its first week.\n\nThe band's third full-length album, Arrivals And Departures, was released on July 3, 2007, and was designated by AP Magazine as one of the most eagerly anticipated CDs of 2007.\nMark Trombino (Jimmy Eat World, Blink-182, Finch) produced the CD. The album sold 27,000 copies in its first week. Silverstein also contributed a\nnew acoustic version of their song \"Red Light Pledge\" to the Punk Goes Acoustic 2 compilation, released May 8, 2007 through Fearless Records.\n\nOn December 14, 2008, the band announced by Myspace bulletin that their fourth album would be released by March 31, 2009. The name of the new album, A Shipwreck in the Sand, was announced on January 29, 2009,\nwhen the band concluded a viral marketing campaign by announcing the track listing via an album website, also revealing it would be a concept album. Along with the demo of \"Broken Stars\",\nhich the band had been performing during their final U.S. tour in support of \"Arrivals and Departures\", short clips of the songs \"Vices\", \"Born Dead\" and\n\"American Dream\" were made available on MySpace On March 17, the band filmed a music video for \"Vices\" with director Robby Starbuck.\nLater, on March 23, 2009, the band posted the full album to stream on their official MySpace page.\n\nA Shipwreck in the Sand was released on March 31, 2009 and sold nearly 17,000 copies in its first week. The iTunes version of the album includes\nfour bonus cover songs, \"Help!\" (The Beatles cover), Go Your Own Way (Fleetwood Mac Cover), Three Miles Down (Saves The Day cover), and Total Bummer (NOFX cover).\n\nSilverstein contributed a cover version of \"Apologize\", originally recorded by OneRepublic, to the Punk Goes Pop 2 compilation album.\n\nOn October 8, 2010, online rumors spread about their new album reportedly being titled Set This All Ablaze, and that it would again be released through Silverstein's long time label, Victory Records.\nThe band later rejected the rumor that the new album will be titled Set This All Ablaze,\nalthough they did confirm their departure from Victory. However, as of the first week of October 2010, Silverstein's official website contained a banner stating Set This All Ablaze.\n\nOn November 15, Silverstein announced on Facebook that they have signed with Hopeless Records in the USA/Europe/Japan and with Universal Music in Canada.\nThey also said that a new EP entitled Transitions will be released December 7 and will feature two songs from their new album coming out next year as well as three additional b-sides.\nIn response to a fan on Tumblr, Shane Told described the new music as \"a cross between Discovering the Waterfront and A Shipwreck in the Sand\". On December 3, 2010,\nthe band posted the first single, Sacrifice, off of the new EP. On February 9, 2011, Silverstein confirmed on their Facebook and Tumblr that their new album will be called Rescue.\nOn February 15, 2011, the band posted the album artwork for Rescue on their official Facebook page. On February 19, 2011, 89X Radio aired a new song from the band named \"Burning Hearts\".\nOn February 22, 2011, in response to a fan on Facebook, the band stated that they were not releasing a traditional lead single from the new album,\nand that they had made three music videos so far. They then went on to state that the new record has \"tons of screaming and breakdowns\". The album, Rescue, was released on April 26, 2011.\nSilverstein has also recorded a song featuring Ryan Key of Yellowcard called \"Stay Posi\" (Stay Positive) for the Take Action! Vol 10. Compilation.\n\nOn October 17, 2011, the band posted a new video on their YouTube channel about an upcoming release. They announced that are in process of recording a new album called Short Songs\nwith producer Jordan Valeriote, scheduled for release on February 7, 2012. They also said that the EP will contain 22 songs under 90 seconds with half songs being covers of punk songs that influenced them.\nSilverstein contributed a cover version of \"Runaway\", originally recorded by Kanye West, to the Punk Goes Pop 4 compilation album, released in November 21, 2011. On December 1, 2011,\nthe band streamed two songs off Short Songs, \"SOS\" and \"Brookfield\", as well as their covers of Green Day's \"The Ballad of Wilhelm Fink\" and NOFX's \"It's My Job to Keep Punk Rock Elite\" on PunkNews.\n\nOn the SHORT TOUR, the band began announcing that they would have a new album in 2013. On September 25, 2012, the band announced that Neil Boshart was no longer a member of the band,\nafter 11 years together. He was replaced by former I Am Committing A Sin guitarist Paul Marc Rousseau. Told later revealed that Boshart's replacement was due to many years of growing apart,\nstating there was very little contribution to Short Songs from Boshart.\n\nOn November 26, 2012, the band announced that their seventh studio album would be titled This Is How the Wind Shifts and would be released on February 5, 2013.\nA few hours later they also released the first single, titled \"Stand Amid The Roar\". On January 15, 2013 the band released the lyric video for the song \"Massachusetts\" from their seventh album.\n\nThe band's eighth studio album I Am Alive In Everything I Touch was released on May 19, 2015. Coinciding with the album's announcement,\nSilverstein released a music video for the track \"A Midwestern State of Emergency.\" On March 4 the band released the second single from the album, Milestone, with a lyric video to accompany the release. On March 16, 2016,\nSilverstein released the third music video from the album, \"The Continual Condition.\" Later, on July 27, 2016, they released a music video for \"Toronto (Unabridged)\".\n\nOn October 13, 2016, Silverstein announced the streaming \"Ghost\" on SiriusXM. Later that day, they released the music video on YouTube and the song on iTunes.\nSilverstein said on social media that the upcoming studio album will be released in 2017. On Thursday, May 18, 2017, Silverstein released the second single from the record, \"Retrograde\",\nas well as announced the track listing and title of the record, \"Dead Reflection\", which was released on July 14, 2017. Dead Reflection was released worldwide on July 14, 2017."
        },
        {
            "src": "saosin",
            "band": "Saosin",
            "genre": "post-hardcore, emo, screamo, rock, emocore, alternative rock",
            "photo": "saosin.jpg",
            "descr": "Saosin is a post-hardcore band from Newport Beach, California, USA who originally formed during 2003 and partly consists of former members of the band Open Hand.\nThey have released a full-length self-titled album (Sept. 26, 2006),\nthree EPs (Translating the Name, a self-titled EP Saosin (also known as the \"Warped Tour EP\" / \"Black EP\", distributed on the The Vans Warped Tour),\nThe Grey EP, and In Search of Solid Ground (released on September 8, 2009).\n\nSeveral individual completed songs have also been included on various compilations. These include I Can Tell There Was An Accident Here Earlier on a compilation album entitled Music on the Brain, Volume 1, \nBury Your Head on the Atticus compilation Atticus: Dragging the Lake 3, Mookie's Last Christmas from the A Santa Cause: It's a Punk Rock Christmas compilation,\nand a remake of their previously recorded song I Wanna Hear Another Fast Song called Sleepers from the Take Action! Volume 5 compilation.\n\nThe band has managed to gain large amounts of respect in the underground scene, only recently enjoying somewhat mainstream status with appearances on television shows\nsuch as \"Steve's Untitled Rock Show\" and radio play of their first single Voices off the new self-titled album.\n\nThere has been a discrepancy about whether Saosin is pronounced \"SAY-oh-sin\" or \"Say-OH-shin\". It was accepted by most to be pronounced either way,\nbut former lead vocalist and founding member of Saosin, Anthony Green,\noffers his explanation on the official Saosin website's \"SAOSIN FAQ\":\n\n\"What does their name mean, and how is it pronounced?\"\nThanks to nailed shut, here is a quote from former singer Anthony:\n\"It’s pronounced SAY-OCEAN. And it’s a Chinese proverb from the 15th and 16th centuries. It means 'small heart'.\nFathers used to marry off their youngest sons for money and used to tell them that they weren’t marrying for love, that their wife doesn’t matter.\nShe could die at anytime so don’t get attached. They had to love with caution and raise their sons to be cold and unfeeling as well.\nI found it in the 8th grade and loved it, I used to name all my old bands that and write songs about it.\"\nAlso, \"saosin\" is actually spelt \"xiao xin\" in correct Chinese, and pronounced \"shaow shin\". It also means \"be careful\" in Chinese.\n(added by ddgcreative: Just came back from a live show with Cove, the new lead singer… and they said, in front of a crowd of about 8,000 people, \"we are say-o-sin\", pronounced sin.)\n(note by MarkoBabic: The band's official stance on the issue is that both pronunciations can be considered correct, as it was really only Anthony who stuck by the pronunciation \"Say-ocean\".\nThis was mentioned in review back in September, 2006 on absolutepunk.net (full interview can be found here).\n\nCurrent Members:\nAnthony Green - Vocals \nBeau Burchell - Guitar, Vocals\nJustin Shekoski - Guitar, Vocals\nChris Sorenson - Bass\nAlex Rodriguez - Drums\n\nFormer Members\nCove Reber - Vocals\nZach Kennedy - Bass, quit for personal reasons and later joining Ashley Simpson's band only to quit in 2006.\nPat McGrath - Session drummer hired by Guitarist/Producer Beau for the \"Translating the Name\" EP. McGrath was formerly a drum tech for Slayer and runs Unchained Studios in San Dimas, CA.\nPhilip Sneed - Sang for the band during the Vans Warped Tour.\n\nWhere are they from?\nChris is from \"Crowntown\" aka Corona, CA. Beau, Justin, and Alex are from Orange County, CA. Cove is from Vista, CA.\n\nWhen did they form?\nThe most commonly-seen live line up didn't come together until about July 2003. The EP was recorded with a different lineup back in March 2003, with Anthony Green on vocals,\nZach Kennedy on bass and Pat McGrath on drums. For their first show (June 19th at the showcase theater in Corona, CA) Chris was on bass, and Danny was on drums. Alex debuted on drums at the July 17th show, also at the showcase in Corona."
        }
    ]
}